---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
source: html/3f331e8b-2b92-e055-9567-175d1084d401.htm
---
# StructuralSectionGeneralH Members

Creates a new instance of Rectangular Pipe shape.